Revit 2025 API
PlasticvinylBumpType Enumeration
 The enumerated type representing the permitted values for the asset property "PlasticvinylBump" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PlasticvinylBumpType
Public Enumeration PlasticvinylBumpType
public enum class PlasticvinylBumpType
type PlasticvinylBumpType
Members
Member name | Value | Description
None | 0
Custom | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace